Repository: common-repository/wp-latest-video-widget
Catalog: lang/wp-latest-video-widget-*.po
Languages: ro_ro

source: Show latest video.
ro_ro: Arată ultimul videoclip.

source: ERROR!
ro_ro: EROARE!

source: Video not set by user
ro_ro: Videoclipul nu este setat de utilizator

source: or
ro_ro: sau

source: no video to show.
ro_ro: nu există niciun videoclip.

source: Video category set by user
ro_ro: Categoria pentru videoclip setată de utilizator

source: do not exist!
ro_ro: nu există!

source: Title
ro_ro: Titlu

source: Category Name:
ro_ro: Nume Categorie:

source: (Ex: Videos)
ro_ro: (Ex: Videoclipuri)

source: Width:
ro_ro: Lățime:

source: Height:
ro_ro: Înălțime:

source: Enable widget title link
ro_ro: Activează link-ul pentru titlul widgetului

source: Where to link widget titile
ro_ro: Unde să trimită linkul

source: To make this widget to work, you must set custom fields in post page.
ro_ro: Pentru a face acest widget să meargă, treguie să setezi in pagina articolului câmpurile proprii/custom fields.

source: First you must set
ro_ro: Prima dată trebuie să setezi

source: (can be youtube,vimeo,apropo).
ro_ro: (poate să fie youtube,vimeo,apropo).

source: For Youtube you must set
ro_ro: Pentru Youtube trebuie să setezi

source: For Vimeo you must set
ro_ro: Pentru Vimeo trebuie să setezi

source: For Apropo.ro/Tare.ro you must set
ro_ro: Pentru Apropo.ro/Tare.ro trebuie să setezi

source: and
ro_ro: și

source: More details and help
ro_ro: Mai multe detalii și ajutor

source: HELP HERE!
ro_ro: AJUTOR AICI!

source: here
ro_ro: aici
